In [1]:
import pandas as pd
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://root:@localhost:3306/stock')
const = engine.connect()
engine = create_engine('sqlite:///c:\\ruby\\port_lite\\db\\development.sqlite3')
conlite = engine.connect()
engine = create_engine('sqlite:///c:\\ruby\\portlt\\db\\development.sqlite3')
conlt = engine.connect()
engine = create_engine('sqlite:///c:\\ruby\\portmy\\db\\development.sqlite3')
conmy = engine.connect()
engine = create_engine('mysql+pymysql://root:@localhost:3306/portfolio_development')
conpf = engine.connect()
engine = create_engine('postgresql+psycopg2://postgres:admin@localhost:5432/portpg_development')
conpg = engine.connect()

### Name change

In [2]:
old_name = 'SCB'
new_name = 'SCBB'

In [3]:
sql = '''
SELECT *
FROM stockname
WHERE name = "%s"'''
sql = sql % (old_name)
stock = pd.read_sql(sql, const)
stock

  name category sector  inport  onwatch  hd  top100
0  SCB    SET50   BANK       0        0   0       1

In [4]:
sql = '''
UPDATE stockname
SET name = "%s"
WHERE name = "%s"'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE stockname
SET name = "SCBB"
WHERE name = "SCB"

In [5]:
rp = const.execute(sql)
rp.rowcount

1

In [6]:
sql = '''
SELECT *
FROM price
WHERE name = "%s"'''
sql = sql % (old_name)
price = pd.read_sql(sql, const)
price.shape

(1446, 7)

In [7]:
sql = '''
UPDATE price
SET name = "%s"
WHERE name = "%s"'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE price
SET name = "SCBB"
WHERE name = "SCB"

In [8]:
rp = const.execute(sql)
rp.rowcount

1446

In [42]:
sql_del = '''
DELETE FROM price
WHERE date = "2021-12-03"
'''
#rp = const.execute(sql_del)
rp.rowcount

172

In [9]:
sql = '''
UPDATE stocks
SET name = "%s"
WHERE name = "%s"'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE stocks
SET name = "SCBB"
WHERE name = "SCB"

In [10]:
rp = conlite.execute(sql)
rp.rowcount

0

### Tickers table

In [11]:
sql = '''
SELECT *
FROM tickers
WHERE name = "%s"'''
sql = sql % (old_name)
ticker = pd.read_sql(sql, conlt)
ticker

,id,name,full_name,sector,subsector,market,website,created_at,updated_at
0,426,SCB,THE SIAM COMMERCIAL BANK PUBLIC COMPANY LIMITED,Financials,Banking,SET50 / SETCLMV / SETTHSI,www.scb.co.th,2017-07-23 06:31:44.091944,2022-01-15 03:54:13.062428

In [12]:
sql = '''
UPDATE tickers
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE tickers
SET name = 'SCBB'
WHERE name = 'SCB'

In [13]:
rp = conlt.execute(sql)
rp.rowcount

1

In [14]:
rp = conmy.execute(sql)
rp.rowcount

1

In [15]:
rp = conpg.execute(sql)
rp.rowcount

1

### Stocks table

In [16]:
sql = '''
UPDATE stocks
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE stocks
SET name = 'SCBB'
WHERE name = 'SCB'

In [17]:
rp = conlt.execute(sql)
rp.rowcount

1

In [18]:
rp = conmy.execute(sql)
rp.rowcount

1

In [19]:
rp = conpg.execute(sql)
rp.rowcount

1

### EPSS table

In [20]:
sql = '''
UPDATE epss
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE epss
SET name = 'SCBB'
WHERE name = 'SCB'

In [21]:
rp = conlt.execute(sql)
rp.rowcount

44

In [22]:
rp = conpg.execute(sql)
rp.rowcount

44

### QT_PROFITS table

In [23]:
sql = '''
UPDATE qt_profits
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE qt_profits
SET name = 'SCBB'
WHERE name = 'SCB'

In [24]:
rp = conlt.execute(sql)
rp.rowcount

26

### YR_PROFITS table

In [25]:
sql = '''
UPDATE yr_profits
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE yr_profits
SET name = 'SCBB'
WHERE name = 'SCB'

In [26]:
rp = conlt.execute(sql)
rp.rowcount

28

In [27]:
rp = conpg.execute(sql)
rp.rowcount

28

### PROFITS table

In [28]:
sql = '''
UPDATE profits
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE profits
SET name = 'SCBB'
WHERE name = 'SCB'

In [29]:
rp = conlt.execute(sql)
rp.rowcount

1

In [30]:
rp = conmy.execute(sql)
rp.rowcount

1

In [31]:
rp = conpg.execute(sql)
rp.rowcount

1

### CONSENSUS table

In [32]:
sql = '''
UPDATE consensus
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE consensus
SET name = 'SCBB'
WHERE name = 'SCB'

In [33]:
rp = conlt.execute(sql)
rp.rowcount

1

In [34]:
rp = conmy.execute(sql)
rp.rowcount

1

In [35]:
rp = conpg.execute(sql)
rp.rowcount

1

### Portfolio database

In [36]:
sql = '''
SELECT * 
FROM stocks
WHERE name = '%s'
'''
sql = sql % old_name
df_tmp = pd.read_sql(sql, conpf)
df_tmp

Empty DataFrame
Columns: [id, name, category_id, website]
Index: []

In [36]:
sql = '''
UPDATE stocks
SET name = "%s"
WHERE name = "%s"'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE stocks
SET name = "MST"
WHERE name = "MBKET"

In [37]:
rp = conpf.execute(sql)
rp.rowcount

1

In [37]:
sql = '''
SELECT * 
FROM dividends
WHERE name = '%s'
'''
sql = sql % old_name
df_tmp = pd.read_sql(sql, conpf)
df_tmp

Empty DataFrame
Columns: [id, stock_id, name, year, quarter, number, ppu, amt, net, x_date, p_date]
Index: []

In [39]:
sql = '''
UPDATE dividends
SET name = "%s"
WHERE name = "%s"'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE dividends
SET name = "MST"
WHERE name = "MBKET"

In [40]:
rp = conpf.execute(sql)
rp.rowcount

0

In [41]:
sql = '''
UPDATE epss
SET ticker_id = 724
WHERE name = 'LPF'
'''
rp = conlt.execute(sql)
rp.rowcount

24

In [42]:
sql = '''
SELECT * 
FROM stocks
WHERE name IN ('LPF','TLGF')'''
df_tmp = pd.read_sql(sql, conlt)
df_tmp

,id,name,market,price,max_price,min_price,pe,pbv,paid_up,market_cap,daily_volume,beta,ticker_id,created_at,updated_at
0,724,LPF,SET,15.7,18,13.4,999.99,1.24,23828.13,36695.34,15.74,0.42,724,2021-07-08 03:42:35.844952,2021-10-09 04:34:50.330467

In [43]:
sql = '''
SELECT * 
FROM tickers
WHERE name IN ('LPF','TLGF')'''
df_tmp = pd.read_sql(sql, conlt)
df_tmp

,id,name,full_name,sector,subsector,market,website,created_at,updated_at
0,724,LPF,LOTUS'S RETAIL GROWTH FREEHOLD AND LEASEHOLD P...,Property & Construction,Property Fund & REITs,SET,None,2021-07-07 03:34:13.818172,2021-07-07 03:34:13.818172